docs/CheatSheet-cmd-line.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-24 Wed 17:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Terminal and Command-Line Cheat Sheet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="simon" />
<link rel="stylesheet" type="text/css" href="../css/gnu.css" />
<link rel="stylesheet" href="../css/gnu.css" />
</head>
<body>
<div id="content">
<h1 class="title">Terminal and Command-Line Cheat Sheet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd23863e">1. Getting Help</a></li>
<li><a href="#org742b28c">2. The <code>TAB</code> key</a></li>
<li><a href="#orgb225e4c">3. History of the command line</a></li>
<li><a href="#orgbb260ef">4. Where I am</a></li>
<li><a href="#orgae8eece">5. Create new directory</a></li>
<li><a href="#orge0bbbd5">6. Change directory</a></li>
<li><a href="#orga3a3275">7. List the content of a directory</a></li>
<li><a href="#org7509a54">8. Read the content of a file</a></li>
<li><a href="#org27857b7">9. Display the first <code>N</code> lines (last <code>N</code> lines)</a></li>
<li><a href="#orgb5cc2f9">10. Clear the terminal window (just cosmetic)</a></li>
<li><a href="#org3ae3ff0">11. Copy file / directory</a></li>
<li><a href="#orgc8d0a1d">12. Rename file / directory</a></li>
<li><a href="#orge1006a6">13. Remove file / directory</a></li>
<li><a href="#org348e4f3">14. Search files</a></li>
<li><a href="#orgb0dc91f">15. Copy files / directory through the network</a></li>
<li><a href="#org4fc6a43">16. Check what is going on</a></li>
<li><a href="#org0353040">17. Kill active process</a></li>
<li><a href="#orgecf8a2d">18. Disconnect the session</a></li>
</ul>
</div>
</div>
<br>
<div align="center">
<a href="CheatSheet-cmd-line.pdf">PDF</a></p>
</div>
<br>

<div class="org-center">
<p>
<b>Open a Terminal and you can directly type the stuff below.</b>
</p>
</div>


<br>
<hr />
<div class="org-center">
<p>
If you have time, enjoy this <a href="https://en.wikipedia.org/wiki/In_the_Beginning..._Was_the_Command_Line">essay</a> by the science-fiction author Neal
Stephenson.
</p>


<p>
Editing file is most of the job, so please also consider using a descent
editor. The author uses and recommends <a href="https://www.gnu.org/software/emacs/">GNU Emacs</a>, because it simply rocks!
</p>
</div>
<hr />
<br>


<div id="outline-container-orgd23863e" class="outline-2">
<h2 id="orgd23863e"><span class="section-number-2">1</span> Getting Help</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-shell">man &lt;command&gt;
</pre>
</div>
<p>
Quit by pressing <code>q</code>.
</p>

<pre class="example">
man ls
man cd
man mkdir
</pre>
</div>
</div>

<div id="outline-container-org742b28c" class="outline-2">
<h2 id="org742b28c"><span class="section-number-2">2</span> The <code>TAB</code> key</h2>
<div class="outline-text-2" id="text-2">
<p>
Whenever entering (long) paths or file names, the <code>TAB</code> key comes in
very handy, because it <b>autocompletes</b> the end or proposes how to
complete. <b>Autocompletion</b> is so handy&#x2026;
</p>

<p>
Imagine you want to enter in this fictional directory, by typing all
these components:
</p>
<pre class="example">
cd /data/home/alturi/project/long-filename.ext
</pre>
<p>
Prone error !! Instead, the <code>TAB</code> key is magic, try:
</p>
<pre class="example">
cd /d[TAB]ata/h[TAB]ome/al[TAB]turi/pro[TAB]ject/lo[TAB]ng-filename.ext
</pre>
<p>
When you type ambiguous character (e.g., <code>pro</code> should point to your
fictional folder <code>project/</code> or <code>product/</code>), the completion does not
work. In that case, hit <code>TAB</code> twice to view all the possible matches and
then type a few more characters.
</p>
</div>
</div>

<div id="outline-container-orgb225e4c" class="outline-2">
<h2 id="orgb225e4c"><span class="section-number-2">3</span> History of the command line</h2>
<div class="outline-text-2" id="text-3">
<p>
Just use <code>ARROW UP</code> and <code>DOWN</code> to navigate through the history.
</p>

<p>
List all the recent history:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #483d8b;">history</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb260ef" class="outline-2">
<h2 id="orgbb260ef"><span class="section-number-2">4</span> Where I am</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #483d8b;">pwd</span>
</pre>
</div>
<p>
Show the absolute path.
</p>
</div>
</div>

<div id="outline-container-orgae8eece" class="outline-2">
<h2 id="orgae8eece"><span class="section-number-2">5</span> Create new directory</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-shell">mkdir &lt;name&gt;
</pre>
</div>
<p>
You can also create the directory and couple of subfolders:
</p>
<pre class="example">
mkdir -p my-project/this/that
</pre>
</div>
</div>

<div id="outline-container-orge0bbbd5" class="outline-2">
<h2 id="orge0bbbd5"><span class="section-number-2">6</span> Change directory</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #483d8b;">cd</span> &lt;directory&gt;
</pre>
</div>
<p>
For example, go to the previous created folder, and verify you are in:
</p>
<pre class="example">
cd my-project/this/that
pwd
</pre>
<p>
Go at one level up (parent directory) and verify again:
</p>
<pre class="example">
cd ..
pwd
</pre>
<p>
Go to the folder <code>that/</code> then go at two levels up:
</p>
<pre class="example">
cd that/
pwd
cd ../..
pwd
</pre>
<p>
Note that:
</p>
<pre class="example">
cd
</pre>
<p>
go to the <code>$HOME</code> folder.
</p>
</div>
</div>

<div id="outline-container-orga3a3275" class="outline-2">
<h2 id="orga3a3275"><span class="section-number-2">7</span> List the content of a directory</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-shell">ls &lt;directory&gt;
</pre>
</div>
<p>
and without any <code>&lt;directory&gt;</code> name, list the current folder.
</p>

<p>
List all the files, even the hidden ones:
</p>
<pre class="example">
ls -a
</pre>
<p>
List the files and sort them by reverse order of modified time:
</p>
<pre class="example">
ls -rt1
</pre>
<p>
List the files with some useful information (permissions, owner, size
etc.)
</p>
<pre class="example">
ls -l
</pre>
<p>
List recursively through the subfolders:
</p>
<pre class="example">
ls -R
</pre>
</div>
</div>

<div id="outline-container-org7509a54" class="outline-2">
<h2 id="org7509a54"><span class="section-number-2">8</span> Read the content of a file</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-shell">less &lt;filename&gt;
</pre>
</div>
<p>
Quit with <code>:q</code>.
</p>
</div>
</div>

<div id="outline-container-org27857b7" class="outline-2">
<h2 id="org27857b7"><span class="section-number-2">9</span> Display the first <code>N</code> lines (last <code>N</code> lines)</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-shell">head -nN &lt;filename&gt;
tail -nN &lt;filename&gt;
</pre>
</div>
<p>
For example, display the first 5 commands:
</p>
<pre class="example">
head -n5 ~/.bash_history
</pre>
</div>
</div>

<div id="outline-container-orgb5cc2f9" class="outline-2">
<h2 id="orgb5cc2f9"><span class="section-number-2">10</span> Clear the terminal window (just cosmetic)</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-shell">clear
</pre>
</div>
<p>
Nothing is erased, it is pure cosmetic by refreshing.
</p>
</div>
</div>

<div id="outline-container-org3ae3ff0" class="outline-2">
<h2 id="org3ae3ff0"><span class="section-number-2">11</span> Copy file / directory</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-shell">cp &lt;source&gt; &lt;target&gt;
</pre>
</div>
<p>
For example, copy the history of the command lines and list the folder:
</p>
<pre class="example">
cp ~/.bash_history ~/my-history
ls -rt1
</pre>
<p>
After creating a new folder, copy the file into it:
</p>
<pre class="example">
cp my-history my-project/this/that
ls my[TAB]-project/[TAB]this/[TAB]that/
</pre>
<p>
Copy folders:
</p>
<pre class="example">
cp -R my-project my-project2
ls -R my-project2
</pre>
</div>
</div>
<div id="outline-container-orgc8d0a1d" class="outline-2">
<h2 id="orgc8d0a1d"><span class="section-number-2">12</span> Rename file / directory</h2>
<div class="outline-text-2" id="text-12">
<pre class="example">
mv &lt;source&gt; &lt;target&gt;
</pre>
</div>
</div>

<div id="outline-container-orge1006a6" class="outline-2">
<h2 id="orge1006a6"><span class="section-number-2">13</span> Remove file / directory</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-shell">rm &lt;filename&gt;
rm -fr &lt;filename&gt;
</pre>
</div>
<p>
The option <code>-f</code> means force. Be careful !!
</p>
</div>
</div>

<div id="outline-container-org348e4f3" class="outline-2">
<h2 id="org348e4f3"><span class="section-number-2">14</span> Search files</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-shell">find &lt;dir&gt; -name <span style="color: #8b2252;">"&lt;filename&gt;"</span> -type f
</pre>
</div>
<p>
For example, list all the files with the extensions <code>.fastq.gz</code> in the
current folder:
</p>
<pre class="example">
find . -name "*.fastq.gz" -type f -print
</pre>
<p>
Find all Pearl files <code>.pl</code> containing the occurence <i>xls</i> and print the line:
</p>
<pre class="example">
find . -type f -name "*.pl" -print | xargs grep -nH xls
</pre>
</div>
</div>

<div id="outline-container-orgb0dc91f" class="outline-2">
<h2 id="orgb0dc91f"><span class="section-number-2">15</span> Copy files / directory through the network</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">
<pre class="src src-shell">rsync -av --progress &lt;source&gt; &lt;target&gt;
</pre>
</div>
<p>
For example, push local folder to server
<code>toto.tata.univ-paris-diderot.fr</code>:
</p>
<pre class="example">
rsync -av --progress my-project username@toto.tata.univ-paris-diderot.fr:~/
</pre>
<p>
Pull remote folder:
</p>
<pre class="example">
rsync -av --progress username@toto.tata.univ-paris-diderot.fr:~/my-project my-project2
</pre>
<p>
Be careful with the trailing slash <code>/</code>. Explanations later !
</p>
</div>
</div>

<div id="outline-container-org4fc6a43" class="outline-2">
<h2 id="org4fc6a43"><span class="section-number-2">16</span> Check what is going on</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-shell">htop
</pre>
</div>
</div>
</div>

<div id="outline-container-org0353040" class="outline-2">
<h2 id="org0353040"><span class="section-number-2">17</span> Kill active process</h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">
<pre class="src src-shell">CONTROL c
</pre>
</div>
<p>
Or you can find the process number with:
</p>
<div class="org-src-container">
<pre class="src src-shell">ps -fe | less
</pre>
</div>
<p>
and identify the guilty.
</p>
</div>
</div>

<div id="outline-container-orgecf8a2d" class="outline-2">
<h2 id="orgecf8a2d"><span class="section-number-2">18</span> Disconnect the session</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">
<pre class="src src-shell">CONTROL d
</pre>
</div>


<br>
<hr />
<br>
<div align="center">
<a href="CheatSheet-cmd-line.pdf">PDF</a></p>
</div>
<br>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-03-08 Thu 00:00</p>
<p class="author">Author: simon</p>
<p class="date">Created: 2018-10-24 Wed 17:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
